"""
Обычное возведение в степень
Реализуйте функцию get_pow() с использованием рекурсии, которая принимает два аргумента в следующем порядке:
a — положительное целое число
n — неотрицательное целое число
Функция должна вычислять значение a в степени n и возвращать полученный результат.
"""


def get_pow():
    pass


print(get_pow(5, 2))  # 25
print(get_pow(99, 0))  # 1
