"""
Функция tribonacci()
Последовательность Трибоначчи – последовательность натуральных чисел, где каждое последующее число является суммой трех предыдущих:
1, 1, 1, 3, 5, 9, 17, 31, 57, 105 …
Реализуйте функцию tribonacci() с использованием рекурсии и мемоизации, которая принимает один аргумент:
n — натуральное число
Функция должна возвращать n-й член последовательности Трибоначчи.
"""


def tribonacci():
    pass


print(tribonacci(1))  # 1
print(tribonacci(7))  # 17
