"""
Функция is_power()
Реализуйте функцию is_power() с использованием рекурсии, которая принимает один аргумент:
number — натуральное число
Функция должна возвращать значение True, если number является степенью числа 2, или False в противном случае.
"""


def is_power():
    pass


print(is_power(512))  # True
print(is_power(15))  # False
