"""
Функция is_palindrome()
Реализуйте функцию is_palindrome() с использованием рекурсии, которая принимает один аргумент:
string — произвольная строка
Функция должна возвращать значение True, если переданная строка является палиндромом, или False в противном случае.
"""


def is_palindrome():
    pass


print(is_palindrome("stepik"))  # False
print(is_palindrome("level"))  # True
