"""
Функция to_binary()
Реализуйте функцию to_binary() с использованием рекурсии, которая принимает один аргумент:
number — неотрицательное целое число
Функция должна возвращать строковое представление числа number в двоичной системе счисления.
"""


def to_binary():
    pass


print(to_binary(15))  # 1111
print(to_binary(0))  # 0
